interfaces/src/main/resources/templates/GeefSociaalStatuut/03.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://magda.vlaanderen.be/soczek/soap/geefsociaalstatuut/v03_00">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefSociaalStatuut>
            <Verzoek>
                <Context>
                    <Naam>GeefSociaalStatuut</Naam>
                    <Versie>03.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                        <Inhoud>
                            <Criteria>
                                <INSZ>90010100123</INSZ>
                                <SocialeStatuten>
                                    <SociaalStatuut>
                                        <Naam>Naam</Naam>
                                        <Datum>
                                            <Datum>2025-01-01</Datum>
                                            <!--
                                            <Periode>
                                                <Begindatum>2025-01-01</Begindatum>
                                                <Einddatum>2026-01-01</Einddatum>
                                            </Periode>
                                            -->
                                        </Datum>
                                        <Locatie>
                                            <Naam>Locatie</Naam>
                                        </Locatie>
                                    </SociaalStatuut>
                                </SocialeStatuten>
                            </Criteria>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefSociaalStatuut>
    </soapenv:Body>
</soapenv:Envelope>